bench/results/java25/20260423T192139Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 2945.34, "p50": "7.56ms", "p95": "16.46ms", "p99": "20.27ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     8.24ms    3.59ms  68.20ms   75.86%\n    Req/Sec   739.90    134.25     1.08k    66.33%\n  Latency Distribution\n     50%    7.56ms\n     75%    9.88ms\n     90%   12.66ms\n     99%   20.27ms\n  353688 requests in 2.00m, 80.62MB read\nRequests/sec:   2945.34\nTransfer/sec:    687.44KB"}